---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCannotCreateCustomConnection
source: html/9ff6de8c-7b65-445e-940c-17aa28c60f72.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCannotCreateCustomConnection Property

Could not create a custom connection.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralCannotCreateCustomConnection { get; }
```